src/Catalogs/ar_ДополнительныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_ДополнительныеНастройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ЗначениеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Ответственный</Name>					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ДатаИзменения</Name>					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ar_Значения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_ЗначениеСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Включено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ar_Соответствие</Name>				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Ключ</Name>							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Значение</Name>							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_ЗначениеСтрока</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ar_НастройкиПовтИсп/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// AgentRunner для 1С
//
// Лицензия: MIT. Полный текст — в файле LICENSE в корне репозитория.
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_НастройкиПовтИсп - кэширующее чтение настроек
// ar_ДополнительныеНастройки (по образцу sp_ДополнительныеНастройкиПовтИсп).
//
// Свойство "Возвращаемые значения: повторное использование - на время сеанса"
// (ReturnValuesReuse=DuringSession): результат каждой экспортной функции
// кэшируется платформой на сеанс ПО ЗНАЧЕНИЯМ ПАРАМЕТРОВ - повторный запрос
// с теми же параметрами не читает базу. Для фоновых заданий (запуск = новый
// сеанс) кэш живёт один запуск, для интерактивных сеансов - до их закрытия.
//
// ВАЖНО: возвращаемые Массив/Соответствие кэшируются ПО ССЫЛКЕ - изменять их
// в вызывающем коде нельзя (испортится кэш сеанса). Только чтение.
//
// Запись настроек здесь НЕ выполняется: она остаётся в ar_Настройки
// (транзакции, СоздатьЕслиНеНайден) и в правах вызывающего кода. После
// программной записи актуальное в том же сеансе значение читают напрямую -
// ar_Настройки.ЗначениеНастройкиБезКэша/СписокЗначенийБезКэша.
//
// Чтение выполняется в привилегированном режиме (как в sp_): настройка -
// служебное данное расширения, читать её может любой код без раздачи прав на
// справочник; в безопасном режиме привилегированный не устанавливается, чтение
// идёт в правах вызывающего.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает скалярное значение настройки по ключу (кэш сеанса).
//
// Настройка считается заданной, если у неё НЕПУСТА ТЧ ar_Значения (это
// настройка-список - тогда Дефолт); иначе непустая ar_ЗначениеСтрока -> строка;
// иначе ar_Значение КАК ЕСТЬ (Ложь/0/пустая Дата - легитимные значения).
// Ключ не найден/настройка выключена/помечена на удаление - Дефолт.
//
// Параметры:
//  Ключ   - Строка       - код элемента справочника (Код).
//  Дефолт - Произвольный - значение при отсутствии активной настройки.
//
// Возвращаемое значение:
//  Произвольный - значение настройки либо Дефолт (кэшируется на сеанс).
//
Функция ЗначениеНастройки(Знач Ключ, Знач Дефолт = Неопределено) Экспорт

	// Привилегированный режим включается В ТЕЛЕ функции (не в хелпере):
	// включённый в процедуре режим гаснет при выходе из неё.
	Если БезопасныйРежим() = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Запись = НайтиЗаписьПоКлючу(Ключ);
	Если Запись = Неопределено Тогда
		Возврат Дефолт;
	КонецЕсли;

	// У настройки-списка скалярного значения нет (см. УстановитьСписок,
	// обнуляющий скалярные поля); факта непустоты ТЧ читается отдельным
	// запросом: вложенная таблица ".(*)" платформой не поддерживается.
	Если ЕстьЭлементыСписка(Ключ) Тогда
		Возврат Дефолт;
	КонецЕсли;

	Если Не ПустаяСтрока(Запись.ar_ЗначениеСтрока) Тогда
		Возврат Запись.ar_ЗначениеСтрока;
	КонецЕсли;

	Возврат Запись.ar_Значение;

КонецФункции

// Возвращает список значений настройки (ТЧ ar_Значения) по ключу
// (кэш сеанса). Ключ не найден, настройка выключена или ТЧ пуста - пустой
// Массив (НЕ ошибка). Возвращаемый Массив кэшируется по ссылке - не мутировать.
//
// Параметры:
//  Ключ - Строка - код элемента справочника (Код).
//
// Возвращаемое значение:
//  Массив - значения строк ТЧ (ar_Значение для не-строковых, ar_ЗначениеСтрока
//           для строк), отфильтрованные по ar_Включено строки.
//
Функция СписокЗначений(Знач Ключ) Экспорт

	// Привилегированный режим включается В ТЕЛЕ функции (не в хелпере):
	// включённый в процедуре режим гаснет при выходе из неё.
	Если БезопасныйРежим() = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Значения.ar_Значение КАК Значение,
		|	Значения.ar_ЗначениеСтрока КАК ЗначениеСтрока
		|ИЗ
		|	Справочник.ar_ДополнительныеНастройки.ar_Значения КАК Значения
		|ГДЕ
		|	Значения.Ссылка.Код = &Ключ
		|	И Значения.Ссылка.ar_Включено
		|	И НЕ Значения.Ссылка.ПометкаУдаления
		|	И Значения.ar_Включено
		|УПОРЯДОЧИТЬ ПО
		|	Значения.НомерСтроки";
	Запрос.УстановитьПараметр("Ключ", Ключ);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ПустаяСтрока(Выборка.ЗначениеСтрока) Тогда
			Результат.Добавить(Выборка.ЗначениеСтрока);
		Иначе
			Результат.Добавить(Выборка.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает соответствие ключ->значение из ТЧ ar_Соответствие настройки
// (кэш сеанса). Ключ не найден, настройка выключена или ТЧ пуста - ПУСТОЕ
// Соответствие (НЕ ошибка). Возвращаемое Соответствие кэшируется по ссылке -
// не мутировать. Значение берётся из ar_ЗначениеСтрока, если она непуста
// (строки длиннее 1024), иначе из ar_Значение.
//
// Параметры:
//  Код - Строка - код элемента справочника (Код).
//
// Возвращаемое значение:
//  Соответствие - Неопределено* / ar_Ключ -> Булево/Число/Дата/Строка/Ссылка.
//
//  * Пустое Соответствие при отсутствии активной настройки.
//
Функция СоответствиеНастройки(Знач Код) Экспорт

	// Привилегированный режим включается В ТЕЛЕ функции (не в хелпере):
	// включённый в процедуре режим гаснет при выходе из неё.
	Если БезопасныйРежим() = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Результат = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Соответствие.ar_Ключ КАК Ключ,
		|	Соответствие.ar_Значение КАК Значение,
		|	Соответствие.ar_ЗначениеСтрока КАК ЗначениеСтрока
		|ИЗ
		|	Справочник.ar_ДополнительныеНастройки.ar_Соответствие КАК Соответствие
		|ГДЕ
		|	Соответствие.Ссылка.Код = &Код
		|	И Соответствие.Ссылка.ar_Включено
		|	И НЕ Соответствие.Ссылка.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Соответствие.НомерСтроки";
	Запрос.УстановитьПараметр("Код", Код);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ПустаяСтрока(Выборка.ЗначениеСтрока) Тогда
			Результат.Вставить(Выборка.Ключ, Выборка.ЗначениеСтрока);
		Иначе
			Результат.Вставить(Выборка.Ключ, Выборка.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает значение из ТЧ ar_Соответствие по ключу соответствия (кэш
// сеанса). Читает полное соответствие (СоответствиеНастройки - тот же кэш)
// и берёт значение по ключу.
//
// Параметры:
//  Код  - Строка       - код элемента справочника (Код).
//  Ключ - Произвольный - ключ в ТЧ ar_Соответствие (Булево/Число/Дата/Строка/Ссылка).
//
// Возвращаемое значение:
//  Произвольный - значение либо Неопределено, если ключа нет.
//
Функция ЗначениеПоКлючуСоответствия(Знач Код, Знач Ключ) Экспорт

	Возврат СоответствиеНастройки(Код)[Ключ];

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Находит активную (ar_Включено, не помечена на удаление) запись справочника
// по Код через запрос (быстрое чтение без получения объекта).
//
// Параметры:
//  Ключ - Строка - код элемента справочника (Код).
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса (позиционирован на строку) либо Неопределено.
//
Функция НайтиЗаписьПоКлючу(Знач Ключ)

	// Вложенная таблица через ".(*)" платформой НЕ поддерживается
	// (Синтаксическая ошибка "*"). Вместо неё - отдельный лёгкий запрос
	// "есть ли хоть одна строка ТЧ": вызывающему коду нужен только факт
	// "список непуст", сами значения читает СписокЗначений.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Настройки.ar_Значение КАК ar_Значение,
		|	Настройки.ar_ЗначениеСтрока КАК ar_ЗначениеСтрока
		|ИЗ
		|	Справочник.ar_ДополнительныеНастройки КАК Настройки
		|ГДЕ
		|	Настройки.Код = &Ключ
		|	И Настройки.ar_Включено
		|	И НЕ Настройки.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ключ", Ключ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Булево - есть ли хотя бы одна ВКЛЮЧЁННАЯ строка в ТЧ ar_Значения активной
// настройки с этим Код. Лёгкая проверка "список непуст" без чтения значений.
//
// Параметры:
//  Ключ - Строка - код элемента справочника (Код).
//
// Возвращаемое значение:
//  Булево.
//
Функция ЕстьЭлементыСписка(Знач Ключ)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Признак
		|ИЗ
		|	Справочник.ar_ДополнительныеНастройки.ar_Значения КАК Значения
		|ГДЕ
		|	Значения.Ссылка.Код = &Ключ
		|	И Значения.Ссылка.ar_Включено
		|	И НЕ Значения.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ключ", Ключ);

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

#КонецОбласти
